#
# Copyright (C) 2021-2022 by TeamYukki@Github, < https://github.com/TeamYukki >.
#
# This file is part of < https://github.com/TeamYukki/YukkiMusicBot > project,
# and is released under the "GNU v3.0 License Agreement".
# Please see < https://github.com/TeamYukki/YukkiMusicBot/blob/master/LICENSE >
#
# All rights reserved.
#Dev : @DEV_SAMIR

HELP_1 = """


**c** تعني  تشغيل في القناه.

/pause or /cpause •

 إيقاف  الموسيقى مؤقتا.👆

/resume or /cresume • 

استئناف الموسيقى المتوقفة مؤقتا.👆

/mute or /cmute • 

كتم صوت الموسيقى المشغلة.👆

/unmute or /cunmute • 

إلغاء كتم صوت الموسيقى الصامتة.👆

/skip or /cskip • 

تخطي تشغيل الموسيقى الحالية.👆

/stop or /cstop- 

إيقاف تشغيل الموسيقى.👆

/shuffle or /cshuffle • 👇

 خلط قائمة التشغيل في قائمة الانتظار .

/seek or /cseek • 👇

توجيه البحث عن الموسيقى إلى المدة الخاصة بك


/seekback or /cseekback • 👇

ابحث عن الموسيقى إلى المدة التي تقضيها

/restart • 

تشغيل بوت للدردشة الخاصة بك.👆

/skip • لتخطي الأغنية الحالية"""

HELP_2 = """


» اوامر التشغيل :

• تشغيل او شغلي+ اسم الاغنية او بالرد على ملف صوتي 

• ايقاف او انهاء  لايقاف التشغيل 

• تخطي او التالي لتخطي الأغنية 

• /play + اسم الاغنية أو رابط اليوتيوب او بالرد على ملف صوتي 

• /stop  لايقاف التشغيل 

• /skib لتخطي الأغنية 

♡ تستخدم الاوامر مع / او بدون"""

HELP_3 = """

» اوامر التشغيل في القناة ⚡:

» /cplay - لتشغيل الموسيقى في القناة 

» /cskip - لـ لتخطي الاغنيه في القناه

» /cstop - لـ إيقاف التشغيل في القناه

»/ping - عرض سرعة الاستجابة

» بحث - للبحث عن نتائج في اليوتيوب

» سورس - لعرض معلومات البوت

« المطور - لعرض مطور السورس """

HELP_4 = """

/start - بدء تشغيل بوت الموسيقى.


/help  -  تفسير مفصلة للاومر.


/ping- لقياس سرعة نت البوت.


/settings • اعدادات الجروب"""

HELP_5 = """

/addsudo - اضافة مطور

/delsudo - حذف مطور

/reboot - إعادة تشغيل البوت

/speedtest - سرعة الخادم

/block + معرف الشخص لحظره

/unblock + معرف الشخص لرفع حظره

/blockedusers - المحظورين

/gban + معرف الشخص لحظره عام

/ungban + معرف الشخص لالغاء حظره عام

/gbannedusers - المحظورين عام

/broadcast -user -assistant -pin + 

الرسالة لأذاعتها👆

/logger [disable | enable] 

معرفة من يستخدم البوت👆

/blacklistchat + معرف القناة او المجموعة 

لحظر جروب 👆

/whitelistchat + معرف القناة او المجموعة 

لرفع حظرها👆

/blacklistedchat - 

المجموعات والقنوات المحظورة👆"""